import React from 'react';
import PropTypes from 'prop-types';
import { Link } from 'gatsby';
import { Section, Wrapper, Button, Title } from '../../elements';

const Contact = ({ id }) => (
  <Section background id={id}>
    <Wrapper>
      <Title center>Gostou do que você leu aqui sobre mim e do que faço e que conversar ?</Title>
      <Link to="/contato">
        <Button big center>
          <svg width="1792" height="1792" viewBox="0 0 1792 1792" xmlns="http://www.w3.org/2000/svg">
            <path d="M1764 11q33 24 27 64l-256 1536q-5 29-32 45-14 8-31 8-11 0-24-5l-453-185-242 295q-18 23-49 23-13 0-22-4-19-7-30.5-23.5t-11.5-36.5v-349l864-1059-1069 925-395-162q-37-14-40-55-2-40 32-59l1664-960q15-9 32-9 20 0 36 11z" />
          </svg>
          Mensagem
        </Button>
      </Link>

      <a href="https://wa.me/5511977185120" target="_blank" rel="noopener noreferrer">
        <Button big whatsapp center>
          <svg id="logo-whatsapp" viewBox="0 0 90 90">
            <title>WhatsApp</title>
            <path
              fill="currentColor"
              d="M90 43.84c0 24.214-19.78 43.842-44.182 43.842a44.256 44.256 0 0 1-21.357-5.455L0 90l7.975-23.522a43.38 43.38 0 0 1-6.34-22.637C1.635 19.63 21.415 0 45.818 0 70.223 0 90 19.628 90 43.84zM45.818 6.983c-20.484 0-37.146 16.535-37.146 36.86 0 8.064 2.63 15.533 7.076 21.61l-4.64 13.688 14.274-4.537a37.128 37.128 0 0 0 20.437 6.097c20.48 0 37.145-16.533 37.145-36.857S66.3 6.983 45.818 6.983zm22.31 46.956c-.272-.447-.993-.717-2.075-1.254-1.084-.537-6.41-3.138-7.4-3.495-.993-.36-1.717-.54-2.438.536-.72 1.076-2.797 3.495-3.43 4.212-.632.72-1.263.81-2.347.27-1.082-.536-4.57-1.672-8.708-5.332-3.22-2.848-5.393-6.364-6.025-7.44-.63-1.076-.066-1.657.475-2.192.488-.482 1.084-1.255 1.625-1.882.543-.628.723-1.075 1.082-1.793.363-.718.182-1.345-.09-1.884-.27-.537-2.438-5.825-3.34-7.977-.902-2.15-1.803-1.793-2.436-1.793-.63 0-1.353-.09-2.075-.09-.722 0-1.896.27-2.89 1.344-.99 1.077-3.788 3.677-3.788 8.964 0 5.288 3.88 10.397 4.422 11.113.54.716 7.49 11.92 18.5 16.223 11.01 4.3 11.01 2.866 12.996 2.686 1.984-.18 6.406-2.6 7.312-5.107.9-2.513.9-4.664.63-5.112z"
            />
          </svg>
          Whatsapp
        </Button>
      </a>
    </Wrapper>
  </Section>
);

export default Contact;

Contact.propTypes = {
  id: PropTypes.string.isRequired,
};
